---
kind: method
id: M:Autodesk.Revit.DB.DisplacementElement.IsElementDisplacedInView(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
source: html/54e4ac85-61ee-0701-c682-3240bf640983.htm
---
# Autodesk.Revit.DB.DisplacementElement.IsElementDisplacedInView Method

Indicates if the specified element displaced in the specified View.

## Syntax (C#)
```csharp
public static bool IsElementDisplacedInView(
	View view,
	ElementId id
)
```

## Parameters
- **view** (`Autodesk.Revit.DB.View`) - The view.
- **id** (`Autodesk.Revit.DB.ElementId`) - The element id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null